MohamedElAzhary/STM32F303RE_MCAL/BSW/Port/Core/Port_core.c
		PORT_REG_PORT_D_LCKR = PORT_REG_LCKR_RESET_VALUE;

		/* Configure Port Output Speed for PORT_D */
		PORT_REG_PORT_D_AFRL = PORT_REG_AFRL_RESET_VALUE | ( (PORT_REG_AFRL_BITS_MASK & PORT_CFG_PORT_D_PIN_0_ALT_FUNC) << PORT_REG_AFRL_AFRL0_0)
											| ( (PORT_REG_AFRL_BITS_MASK & PORT_CFG_PORT_D_PIN_1_ALT_FUNC) << PORT_REG_AFRL_AFRL1_0)
											| ( (PORT_REG_AFRL_BITS_MASK & PORT_CFG_PORT_D_PIN_2_ALT_FUNC) << PORT_REG_AFRL_AFRL2_0)
											| ( (PORT_REG_AFRL_BITS_MASK & PORT_CFG_PORT_D_PIN_3_ALT_FUNC) << PORT_REG_AFRL_AFRL3_0)
											| ( (PORT_REG_AFRL_BITS_MASK & PORT_CFG_PORT_D_PIN_4_ALT_FUNC) << PORT_REG_AFRL_AFRL4_0)
											| ( (PORT_REG_AFRL_BITS_MASK & PORT_CFG_PORT_D_PIN_5_ALT_FUNC) << PORT_REG_AFRL_AFRL5_0)
											| ( (PORT_REG_AFRL_BITS_MASK & PORT_CFG_PORT_D_PIN_6_ALT_FUNC) << PORT_REG_AFRL_AFRL6_0)
											| ( (PORT_REG_AFRL_BITS_MASK & PORT_CFG_PORT_D_PIN_7_ALT_FUNC) << PORT_REG_AFRL_AFRL7_0);

		/* Configure Port Output Speed for PORT_D */
		PORT_REG_PORT_D_AFRH = PORT_REG_AFRH_RESET_VALUE | ( (PORT_REG_AFRH_BITS_MASK & PORT_CFG_PORT_D_PIN_0_ALT_FUNC) << PORT_REG_AFRH_AFRH0_0)
											| ( (PORT_REG_AFRH_BITS_MASK & PORT_CFG_PORT_D_PIN_1_ALT_FUNC) << PORT_REG_AFRH_AFRH1_0)
											| ( (PORT_REG_AFRH_BITS_MASK & PORT_CFG_PORT_D_PIN_2_ALT_FUNC) << PORT_REG_AFRH_AFRH2_0)
											| ( (PORT_REG_AFRH_BITS_MASK & PORT_CFG_PORT_D_PIN_3_ALT_FUNC) << PORT_REG_AFRH_AFRH3_0)
											| ( (PORT_REG_AFRH_BITS_MASK & PORT_CFG_PORT_D_PIN_4_ALT_FUNC) << PORT_REG_AFRH_AFRH4_0)
											| ( (PORT_REG_AFRH_BITS_MASK & PORT_CFG_PORT_D_PIN_5_ALT_FUNC) << PORT_REG_AFRH_AFRH5_0)
											| ( (PORT_REG_AFRH_BITS_MASK & PORT_CFG_PORT_D_PIN_6_ALT_FUNC) << PORT_REG_AFRH_AFRH6_0)
											| ( (PORT_REG_AFRH_BITS_MASK & PORT_CFG_PORT_D_PIN_7_ALT_FUNC) << PORT_REG_AFRH_AFRH7_0);


		#endif /* End of #if(PORT_CFG_PORT_D_ENABLE == STD_ON) */

		#if(PORT_CFG_PORT_E_ENABLE == STD_ON)
		/* Enable PORT E Clock */
		RCC_REG_AHBENR |= (RCC_CONST_CLOCK_ENABLED<<RCC_REG_AHBENR_IOPEEN);

		/* Configure Port Mode for PORT_E */
		PORT_REG_PORT_E_MODER = PORT_REG_MODER_RESET_VALUE | ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_0_MODE) << PORT_REG_MODER_MODER0_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_1_MODE) << PORT_REG_MODER_MODER1_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_2_MODE) << PORT_REG_MODER_MODER2_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_3_MODE) << PORT_REG_MODER_MODER3_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_4_MODE) << PORT_REG_MODER_MODER4_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_5_MODE) << PORT_REG_MODER_MODER5_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_6_MODE) << PORT_REG_MODER_MODER6_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_7_MODE) << PORT_REG_MODER_MODER7_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_8_MODE) << PORT_REG_MODER_MODER8_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_9_MODE) << PORT_REG_MODER_MODER9_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_10_MODE) << PORT_REG_MODER_MODER10_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_11_MODE) << PORT_REG_MODER_MODER11_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_12_MODE) << PORT_REG_MODER_MODER12_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_13_MODE) << PORT_REG_MODER_MODER13_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_14_MODE) << PORT_REG_MODER_MODER14_0)
											| ( (PORT_REG_MODER_BITS_MASK & PORT_CFG_PORT_E_PIN_15_MODE) << PORT_REG_MODER_MODER15_0);

		/* Configure Port Output Type for PORT_E */
		PORT_REG_PORT_E_OTYPER = PORT_REG_OTYPER_RESET_VALUE | ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_0_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER0_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_1_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER1_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_2_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER2_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_3_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER3_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_4_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER4_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_5_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER5_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_6_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER6_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_7_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER7_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_8_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER8_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_9_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER9_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_10_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER10_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_11_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER11_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_12_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER12_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_13_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER13_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_14_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER14_0)
											| ( (PORT_REG_OTYPER_BITS_MASK & PORT_CFG_PORT_E_PIN_15_OUTPUT_TYPE) << PORT_REG_OTYPER_OTYPER15_0);

		/* Configure Port Output Speed for PORT_E */
		PORT_REG_PORT_E_OSPEEDR = PORT_REG_OSPEEDR_RESET_VALUE | ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_0_SPEED) << PORT_REG_OSPEEDR_OSPEEDR0_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_1_SPEED) << PORT_REG_OSPEEDR_OSPEEDR1_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_2_SPEED) << PORT_REG_OSPEEDR_OSPEEDR2_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_3_SPEED) << PORT_REG_OSPEEDR_OSPEEDR3_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_4_SPEED) << PORT_REG_OSPEEDR_OSPEEDR4_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_5_SPEED) << PORT_REG_OSPEEDR_OSPEEDR5_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_6_SPEED) << PORT_REG_OSPEEDR_OSPEEDR6_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_7_SPEED) << PORT_REG_OSPEEDR_OSPEEDR7_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_8_SPEED) << PORT_REG_OSPEEDR_OSPEEDR8_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_9_SPEED) << PORT_REG_OSPEEDR_OSPEEDR9_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_10_SPEED) << PORT_REG_OSPEEDR_OSPEEDR10_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_11_SPEED) << PORT_REG_OSPEEDR_OSPEEDR11_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_12_SPEED) << PORT_REG_OSPEEDR_OSPEEDR12_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_13_SPEED) << PORT_REG_OSPEEDR_OSPEEDR13_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_14_SPEED) << PORT_REG_OSPEEDR_OSPEEDR14_0)
											| ( (PORT_REG_OSPEEDR_BITS_MASK & PORT_CFG_PORT_E_PIN_15_SPEED) << PORT_REG_OSPEEDR_OSPEEDR15_0);

